src/cf/Reports/IrrelevantFilesVolume.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>IrrelevantFilesVolume</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/FilesClearingSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>FilesClearingSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>FilterRule</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Action</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FilesCleanupOptions</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClearingPeriod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FilesCleanupPeriod</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsFile</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>FileOwner</Name>
					<Comment>APK:1330 it is not possible to combine 2 composite types</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>FileOwnerType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/FilesCleanupOptions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>FilesCleanupOptions</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CleanUpFilesAndVersions</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CleanUpFiles</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CleanUpVersions</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotClear</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/IrrelevantFilesVolume/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// 

// Parameters:
//   Settings - See ReportsOptionsOverridable.CustomizeReportsOptions.Settings.
//   ReportSettings - See ReportsOptions.DescriptionOfReport.
//
Procedure CustomizeReportOptions(Settings, ReportSettings) Export
	
	ModuleReportsOptions = Common.CommonModule("ReportsOptions");
	ModuleReportsOptions.SetOutputModeInReportPanels(Settings, ReportSettings, False);
	
	OptionSettings = ModuleReportsOptions.OptionDetails(Settings, ReportSettings, "IrrelevantFilesVolumeByOwners");
	OptionSettings.LongDesc = NStr("en = 'Total size of unused files.';");
	
EndProcedure

// See ReportsOptionsOverridable.DefineObjectsWithReportCommands.
Procedure OnDefineObjectsWithReportCommands(Objects) Export
	
	Objects.Add(Metadata.InformationRegisters.FilesClearingSettings);
	
EndProcedure

// End StandardSubsystems.ReportsOptions

#EndRegion

#EndRegion

#Region Private

// Generates a table of unnecessary files.
//
// Returns:
//   ValueTable:
//   * FileOwner - DefinedType.FilesOwner
//   * IrrelevantFilesVolume - Number - 
//
Function UnusedFilesTable() Export
	
	CleanupSettings = InformationRegisters.FilesClearingSettings.CurrentClearSettings();
	
	UnusedFilesTable = New ValueTable;
	UnusedFilesTable.Columns.Add("FileOwner");
	UnusedFilesTable.Columns.Add("IrrelevantFilesVolume", New TypeDescription("Number"));
	
	FilesClearingSettings  = CleanupSettings.FindRows(New Structure("IsCatalogItemSetup", False));
	
	For Each Setting In FilesClearingSettings Do
		
		ExceptionsArray = New Array;
		DetailedSettings = CleanupSettings.FindRows(New Structure(
			"OwnerID, IsCatalogItemSetup",
			Setting.FileOwner,
			True));
		If DetailedSettings.Count() > 0 Then
			For Each ExceptionItem In DetailedSettings Do
				ExceptionsArray.Add(ExceptionItem.FileOwner);
				ToSupplementTheTableOfUnnecessaryFiles(UnusedFilesTable, ExceptionItem, ExceptionsArray);
			EndDo;
		EndIf;
		
		ToSupplementTheTableOfUnnecessaryFiles(UnusedFilesTable, Setting, ExceptionsArray);
	EndDo;
	
	Return UnusedFilesTable;
	
EndFunction

Procedure ToSupplementTheTableOfUnnecessaryFiles(UnusedFilesTable, ClearingSetup, ExceptionsArray)
	
	If ClearingSetup.Action = Enums.FilesCleanupOptions.NotClear Then
		Return;
	EndIf;
	
	If ExceptionsArray = Undefined Then
		ExceptionsArray = New Array;
	EndIf;
	
	UnusedFiles = FilesOperationsInternal.CollectUnusedFiles(ClearingSetup, ExceptionsArray);
	For Each UnnecessaryFile In UnusedFiles.Rows Do
		NewRow = UnusedFilesTable.Add();
		NewRow.FileOwner = UnnecessaryFile.FileOwner;
		NewRow.IrrelevantFilesVolume = ?(UnnecessaryFile.Rows.Count() > 0, 0, UnnecessaryFile.Size);
		For Each UnusedFileVersion In UnnecessaryFile.Rows Do
			NewRow.IrrelevantFilesVolume = NewRow.IrrelevantFilesVolume + UnusedFileVersion.Size;
		EndDo
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
